cases/validation_nielsen_1990/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.455 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    topWall
    {
        type            noSlip;
    }
    bottomWall
    {
        type            noSlip;
    }
    leftWall
    {
        type            noSlip;
    }
    rightWall
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
