cases/validation_nielsen_1990/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    leftWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    rightWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}
